import json

# Дана строка ФИО преобразовать в Фамилия И.О.
# ________________________________________________________________________________
# мое решение
fio = 'yudin sergey arcadiyevich'
lst_fio = fio.split(' ')
print(lst_fio[0].title() + ' ' + lst_fio[1][0].title() + '.' + lst_fio[2][0].title() + '.')
# через f строки
print(f"{lst_fio[0].title()} {lst_fio[1][0].title()}.{lst_fio[2][0].title()}.")
# ________________________________________________________________________________

# проверка соответствует ли введенная строка формату YYYY-MM-DD
# ________________________________________________________________________________
# мое решение
d = '2022-02-21'
d1 = '2022-42-21'


def check(date):
    date_list = date.split('-')
    if len(date_list) == 3 and len(date_list[0]) == 4 and 1 <= int(date_list[1]) <= 12 and 1 <= int(date_list[2]) <= 31:
        return True
    else:
        return False

print(check(d))
print(check(d1))
# ________________________________________________________________________________

# получает список из чисел, возвращает словарь, где значение каждого ключа
# сколько раз оно встретилось в списке
# ________________________________________________________________________________
# мое решение
numbers = [1, 2, 1, 3, 3, 3]


def numbers_repeat(numbs: list):
    # С помощью генератора словарей создаю словарь
    # в котором значение ключа есть цифра из списка, а значение кол-во повторений в этом списке
    # с помощью метода count
    return {item: numbs.count(item) for item in numbs}


print(numbers_repeat(numbers))
# ________________________________________________________________________________
# Сохранение данных в фале и считывание, корректно для питона


def save_info(info):
    with open('info.json', 'w') as file:
        json.dump(info, file)


def load_info():
    with open('info.json') as file:
        return json.load(file)


print(load_info())
# ________________________________________________________________________________

