# Напишите программу, которая на вход принимает текст и выводит количество уникальных символов
text = 'The Zen of Python'
print(len(set(text)))